# Создать телефонный справочник с
# возможностью импорта и экспорта данных в
# формате .txt. Фамилия, имя, отчество, номер
# телефона - данные, которые должны находиться
# в файле.

# 1. Программа должна выводить данные
# 2. Программа должна сохранять данные в текстовом файле
# 3. Пользователь может ввести одну из характеристик для поиска определенной записи(Например имя или фамилию человека)
# 4. Удалять данные.
# 5. Использование функций. 

import funk
while True:
    print('1. вывод, 2. добавление, 3. поиск, 4. редактирование, 5. удаление, 6. exit')
    mode = int(input())
    if mode == 1:
        funk.show_data()
    elif mode == 2:
        funk.add_data()
    elif mode == 3:
        funk.find_data()
    elif mode == 4:
        funk.edit_data()
    elif mode == 5:
        funk.del_data()
    else:
        break